In [15]:
import pandas as pd

In [16]:
data = {'col1':['1','2','3','teks'],
       'col2':['1','2','3','4']}
df = pd.DataFrame(data)
df

   col1 col2
0     1    1
1     2    2
2     3    3
3  teks    4

In [17]:
df.dtypes

col1    object
col2    object
dtype: object

In [18]:
#konversi tipe data dengan function .astype()

df_x = df.astype({'col2':'int'})
df_x

   col1  col2
0     1     1
1     2     2
2     3     3
3  teks     4

In [19]:
df_x.dtypes

col1    object
col2     int32
dtype: object

In [20]:
#konversi tipe data dengan function .to_numeric()
#konversi berlaku untuk seluruh DataFrame
#df.apply = menerapkan pada dataframe df
#parameter errors = coarce
#coarce yaitu
#kalau didapati suatu data yg tidak bisa dikonverksikan ke numerik \
#maka data tsb akan digantikan Nan atau missing value


df.apply(pd.to_numeric, errors='coerce')

   col1  col2
0   1.0     1
1   2.0     2
2   3.0     3
3   NaN     4